Rename from node manager to command core
